## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.equalvote-argocd will be created
  + resource "azurerm_key_vault" "equalvote-argocd" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "westus2"
      + name                          = "equalvote-argocd"
      + public_network_access_enabled = true
      + resource_group_name           = "equalvote"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "fb5b09d0-6c7c-4bf2-adf7-6fb61f902de9"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_access_policy.argocd-policy will be created
  + resource "azurerm_key_vault_access_policy" "argocd-policy" {
      + id              = (known after apply)
      + key_permissions = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
          + "Release",
          + "Rotate",
          + "GetRotationPolicy",
          + "SetRotationPolicy",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = (known after apply)
      + tenant_id       = (known after apply)
    }

  # azurerm_user_assigned_identity.argocd-identity will be created
  + resource "azurerm_user_assigned_identity" "argocd-identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westus2"
      + name                = "argocd"
      + principal_id        = (known after apply)
      + resource_group_name = "equalvote"
      + tenant_id           = (known after apply)
    }

  # kubernetes_service_account.aks_argocd will be created
  + resource "kubernetes_service_account" "aks_argocd" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "azure.workload.identity/use" = "true"
            }
          + name             = "aks-argocd"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>